blog/2021/07/21/ljg-gtd/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>总结：如何完成一个目标 - 你对这个世界要有点意见</title>
  <meta charset="utf-8" />
  <meta name="author" content="lijigang" />


  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">
</head>

  <body class="container">
<header id="header">
<body>
    <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
        <div class="container-fluid">
<div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">你对这个世界要有点意见</a>
        </div>
<div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                <li class="active"><a href="/">Blog</a></li>
          <li><a href="https://github.com/lijigang">GitHub</a></li>
          <li><a href="http://www.zhihu.com/people/lijigang.com">知乎</a></li>
        </ul>
</div>
</div>
    </nav>
</body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row post-content">
        <div class="col-md-2"></div>
            <h1>总结：如何完成一个目标</h1>
            <p>
设想你设定了一个想要实现的目标(比如三个月时间考过英语六级), 对着这个宏伟
的目标, 先从哪下手呢?
</p>

<p>
当对一个东西无从下手的时候, 最好的办法就是将其大而化小, 小到你知道怎么下
手为止。
</p>

<p>
具体来说, 两步走:
</p>

<ol class="org-ol">
<li>将复杂目标拆解成任务</li>

<li>按 GTD 流程完成这些任务</li>
</ol>

<div id="outline-container-orge7c2a31" class="outline-2">
<h2 id="orge7c2a31">拆解目标为任务</h2>
<div class="outline-text-2" id="text-orge7c2a31">
<p>
<b>为什么要拆解?</b>
</p>

<p>
拆解之后, 一个大的问题就变成了一堆小问题的集合。 通过解决一个个知道如
何解决的小问题, 实现解决大的问题。
</p>

<p>
<b>如何将目标拆解成子目标?</b>
</p>

<p>
可以通过 <span class="underline">加法</span> 或 <span class="underline">乘法</span> 的方式来拆解目标。 加法是指目标是由 A + B + C
三部分组合而成, 分别解决 A, B, C 就解决了我们的目标。 乘法是指目标是
由 A * B * C 三个变量因素关联而成, 我们需要针对 A, B, C 专项讨论提升,
进而解决目标。
</p>

<p>
<b>子目标什么时候才会被称作任务?</b>
</p>

<p>
当你把目标拆解成子目标(组成因素)之后, 如果面对子目标, 仍然无从下手,
就可针对某个子目标, 同样使用 <span class="underline">加法</span> 或 <span class="underline">乘法</span> 的方式, 做进一步的拆解, 直
到拆解出的子目标可以被你轻松解决为止。
</p>

<p>
如何判断 <b>轻松解决</b> 呢? 当一个子目标可以被 <b>谁</b> <b>在什么时间</b> <b>做什么事情</b>
(Who do what by when) 很容易的描述时, 就可以被称作是 <span class="underline">任务</span> (Task) 了。
</p>
</div>
</div>

<div id="outline-container-org2939a50" class="outline-2">
<h2 id="org2939a50">执行任务流程</h2>
<div class="outline-text-2" id="text-org2939a50">
<p>
那拆解完成后, 得到了一堆的任务, 这时候怎么办呢?
</p>

<p>
用 <b>GTD</b> 流程来将这些任务一个个解决即可。
</p>

<p>
GTD 流程可以分为这么四步:
</p>
</div>

<div id="outline-container-orgde4ec11" class="outline-3">
<h3 id="orgde4ec11">收集(Capture)</h3>
<div class="outline-text-3" id="text-orgde4ec11">
<p>
将上面的任务, 统一按照下面的方式整理到一个文件:
</p>

<pre class="example" id="orgb3bfc1e">
@某人: 做什么 (Deadline)
</pre>

<p>
在这个录入过程中, 需要思考:
</p>
<ol class="org-ol">
<li>删除: 这个任务是不是可以删除不做, 也不会影响</li>
<li>委托: 这个任务是不是可以交给其它人来帮忙做</li>
<li>时间：这个任务的最终完成时间是什么时候</li>
</ol>
</div>
</div>

<div id="outline-container-org3d7f758" class="outline-3">
<h3 id="org3d7f758">处理(Process)</h3>
<div class="outline-text-3" id="text-org3d7f758">
<p>
将上一步收集并设定 Deadline 的任务, 在你的日历中呈现。
</p>

<p>
每天从中挑出当天需要完成的任务即可。
</p>
</div>
</div>

<div id="outline-container-org925af84" class="outline-3">
<h3 id="org925af84">复盘(Fupan)</h3>
<div class="outline-text-3" id="text-org925af84">
<p>
参照 <a href="https://www.lijigang.com/blog/2021/07/05/how-to-fupan/">TMD 复盘法</a>
</p>
</div>
</div>
</div>

    </div>
</section>




<footer id="footer">
    <br />
    <script>
        var _hmt = _hmt || [];
        (function() {
            var hm = document.createElement("script");
            hm.src = "https://hm.baidu.com/hm.js?36d44a2295ffa55a3ab51c6aa7a71733";
            var s = document.getElementsByTagName("script")[0];
            s.parentNode.insertBefore(hm, s);
        })();
    </script>
</footer>

  </body>
</html>
